[
  {
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-doubts-putin-willing-end-ukraine-war-zelenskyy-rome-rcna203142",
    "title": "Trump questions Putin's commitment to ending Ukraine war",
    "paragraphs": [
      "President Donald Trump on Saturday questioned Russian President Vladimir Putin’s commitment to ending the war in Ukraine after Trump met with Ukrainian President Volodymyr Zelenskyy on the sidelines of Pope Francis’ funeral in Rome.",
      "“There was no reason for Putin to be shooting missiles into civilian areas, cities and towns, over the last few days,” the U.S. president wrote in a post on Truth Social, referencing the Russian military strikes in Ukraine this week that killed and wounded dozens of people.",
      "“It makes me think that maybe he doesn’t want to stop the war, he’s just tapping me along,” Trump added, suggesting that maybe Putin “has to be dealt with differently, through ‘Banking’ or ‘Secondary Sanctions?’”",
      "Imposing further sanctions on Russia is an idea that has bipartisan support in the U.S., with a bipartisan group of 50 senators — 25 Democrats and 25 Republicans — earlier this month introducing a bill that would impose additional sanctions on Russia.",
      "Trump has for weeks been advocating in favor of a peace deal between Russia and Ukraine, and on Friday he hinted that a deal could be close to the finish line, urging Russia and Ukraine to meet for “very high level” talks. Earlier in the week, Trump had slammed Zelesnkyy for rejecting the terms of any peace deal that would allow Russia to retain control of Crimea, which it annexed against Ukraine’s will in 2014.",
      "In a post on X after meeting with Trump in Rome, Zelenskyy thanked the American president and called the meeting “good” and “symbolic.”",
      "The Ukrainian president added that he is “hoping for results on everything we covered,” which included: “Protecting lives of our people. Full and unconditional ceasefire. Reliable and lasting peace that will prevent another war from breaking out.”",
      "Zelenskyy added that the exchange with Trump has the “potential to become historic, if we achieve joint results.”",
      "In his Truth Social post on Saturday, Trump blamed his predecessors, Presidents Barack Obama and Joe Biden, for allowing Russia to annex Crimea.",
      "“It was Obama who made it possible for Russia to steal Crimea from Ukraine without even a shot being fired,” Trump wrote, adding later in the post: “I’m just trying to clean up the mess that was left to me by Obama and Biden, and what a mess it is.”",
      "Trump and Zelenskyy’s meeting in Rome was their first face-to-face interaction since the Ukrainian president’s visit to the White House in February. During that visit, an Oval Office meeting devolved into a shouting match between Trump, Zelenskyy and Vice President JD Vance, with Trump and Vance telling Zelenskyy he wasn’t grateful enough for the United States’ continued support in the war.",
      "While in Rome, Zelenskyy also met with European leaders, including U.K. Prime Minister Keir Starmer and French President Emmanuel Macron, who wrote in French on X that he had a “very positive exchange today” with Zelenskyy.",
      "“Ending the war in Ukraine is the goal we share with President Trump. Ukraine is ready for an unconditional ceasefire. President Zelensky reiterated this to me today. He wants to work alongside the Americans and Europeans to implement it. Now it’s up to President Putin to prove that he really wants peace,” Macron added.",
      "Zelenskyy said his discussion with Starmer focused on “the steps necessary to establish a full, unconditional ceasefire and to develop further security guarantees.”",
      "Alexandra Marquez is a politics reporter for NBC News."
    ]
  },
  {
    "url": "https://www.nbcnews.com/world/the-vatican/simple-ceremony-powerful-homily-pope-francis-funeral-morality-politics-rcna203132",
    "title": "A simple ceremony and a powerful homily: Pope Francis funeral held a moral mirror to  modern politics",
    "paragraphs": [
      "Even in death, Pope Francis’ moral voice rang out across the world.",
      "With 40,000 packed into Vatican City’s St. Peter’s Square, another 250,000 in the surrounding streets and millions more watching on TV and online, world leaders, including President Donald Trump, were reminded of Francis’ central messages during his funeral Saturday.",
      "“‘Build bridges, not walls’ was an exhortation he repeated many times,” Cardinal Giovanni Battista Re said during the homily for the late pope. “His gestures and exhortations in favor of refugees and displaced persons are countless. His insistence on working on behalf of the poor was constant.”",
      "And war “always leaves the world worse than it was before: It is always a painful and tragic defeat for everyone,” Re said.",
      "Francis often railed against the geopolitical tides. He urged more compassion for immigrants and refugees at a time when the White House and other governments are cracking down. He called for an end to the war in Gaza and denounced climate change and exploitative capitalism — when those crises have only intensified.",
      "Under warm, blue skies with the world watching, the homily was a reminder of Francis’ often lonely voice in a world characterized by economic and military hard power. It also brought to mind the unspoken questions, on this day at least, about whether the late pontiff’s replacement will continue these progressive notes or revert to a more conservative bent.",
      "The relatively simple funeral for Francis, who died at age 88 on Monday, was attended by some 170 heads of state and other dignitaries. Trump sat among Ukraine’s Volodymyr  Zelenskyy, France’s Emmanuel Macron, Brazil’s President Luiz Inácio Lula da Silva and Britain’s Prince William.",
      "Francis’ casket was taken on a final journey in the so-called popemobile through the streets of Rome, past landmarks such as the Colosseum, to St. Mary Major Basilica, where he had chosen to be buried.",
      "The people lining the streets had come from all over the world.",
      "“I could not have been anywhere else today. For me, Pope Francis was a wonderful pope, a gift that the lord gave us,” said Katherine Gilligan, 59, who was visiting Rome last week from Jacksonville, Florida, and decided to postpone her return journey when Francis died. “He has loved us and taught us piety. It will be difficult for there to be another pope like him.”",
      "At St. Mary Major Basilica, his casket was met, according to his wishes, by dozens of Rome’s impoverished and needy, including prisoners, migrants, homeless and transgender people.",
      "It was just one reflection of a pope who did things a bit differently. He had even adjusted his own funeral plans: Whereas previous popes have been entombed in three nested coffins, made of cypress, lead and oak, Francis requested he be buried in a single, simple wooden casket lined with zinc.",
      "Even so, this was an event of epic majesty. From the arcing dome of St. Peter’s Basilica, one of the largest churches in the world, to the striking image of a square divided between a mass of red on one side — the cardinals and bishops — and black on the other — attending dignitaries.",
      "In life, Francis had declined to live in the Vatican’s gilded Apostolic Palace, choosing instead its far more plebeian guesthouse, Casa Santa Marta, where he died after a period of well-publicized illness.",
      "Francis had plenty of critics, both conservatives who believed he focused too much on progressive causes, and more liberal audiences who felt he did not go far enough with his reforms.",
      "Either way, the absence of his frequent and outspoken interjections on world affairs will leave a void to be filled. And though he spoke with a freedom unafforded to more prominent global figures, his funeral was still a deeply political event.",
      "Re’s reminder that Francis preferred bridges over walls conjured the late pope’s criticism of Trump’s first-term promise to build a U.S.-Mexico border wall.",
      "“A person who thinks only about building walls, wherever they may be, and not building bridges is not Christian,” he said at the time.",
      "One day before his death, Francis met with Vice President JD Vance after sharply rebuking the Trump administration for cracking down on immigration and slashing international aid. In February, he said a “major crisis” was taking place in the United States, referring to “a program of mass deportations.”",
      "Perhaps inevitably with so many powerful figures in attendance, the funeral served as a forum for real-world geopolitics. Trump was seen locked in a sit-down discussion with Zelenskyy, two of the parties who say they are trying to negotiate a peace deal alongside Russia’s Vladimir Putin.",
      "The Ukrainian leader said on X afterward that it was a “good meeting.” But there was little immediate sign that Francis’ death would solve a crisis he was unable to affect in life.",
      "Nevertheless, despite scandal within the church and uncertainty without, there was plenty of Francis’ platform that few would disagree with.",
      "Re reflected this while closing the homily: “Embrace humanity that seeks the truth with a sincere heart and holds high the torch of hope.”",
      "Alexander Smith is a senior reporter for NBC News Digital based in London."
    ]
  },
  {
    "url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027",
    "title": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide",
    "paragraphs": [
      "Virginia Giuffre, one of the most prominent survivors of Jeffrey Epstein’s sexual abuse, has died by suicide, her family said Friday.",
      "Giuffre, 41, died in Neergabby, Australia, where she had been living for several years.",
      "Giuffre was one of the earliest and loudest voices calling for criminal charges against Epstein and his enablers. Other Epstein abuse survivors later credited her with giving them the courage to speak out.",
      "She also provided critical information to law enforcement that contributed to the investigation into and later the conviction of Epstein’s associate Ghislaine Maxwell, as well as other investigations by the U.S. attorney for the Southern District of New York.",
      "\"It is with utterly broken hearts that we announce that Virginia passed away last night at her farm in Western Australia,\" her family said in a statement to NBC News. \"She lost her life to suicide, after being a lifelong victim of sexual abuse and sex trafficking.\"",
      "\"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors,\" the statement said. “In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\"",
      "Raised primarily in Florida, Giuffre had a troubled childhood. She said she was abused by a family friend, triggering a downward spiral that led to her living on the streets for a time as a teenager.",
      "She was attempting to rebuild her life when she met Maxwell, Epstein’s close confidant. Maxwell groomed her to be sexually abused by Epstein, and that abuse continued from 1999 to 2002, according to Giuffre. Giuffre also alleged that Epstein trafficked her to his powerful friends, including Prince Andrew and French modeling agent Jean-Luc Brunel.",
      "Epstein, a wealthy financier, died by suicide in a New York jail in 2019 while he was awaiting trial on federal sex trafficking charges.",
      "Maxwell, a former British socialite, was found guilty on five counts of sex trafficking in 2021 for her role in recruiting young girls to be abused by Epstein.",
      "Giuffre filed a federal lawsuit against Andrew in 2021, alleging that he sexually abused her when she was 17. Andrew, who stepped back from his duties as an active royal as controversy related to Epstein swirled around him, agreed to settle the case for an undisclosed amount in 2022. He has denied having sex with her.",
      "Brunel, who headed several modeling agencies, was charged with sexual harassment and the rape of at least one minor in December 2020. He denied wrongdoing and died by suicide in his jail cell in February 2022.",
      "Several months prior, Giuffre testified against Brunel in a Paris courtroom in June 2021. In an interview after her daylong closed-door testimony, Giuffre said she appeared in court to be a voice for the victims and to make sure Brunel was brought to justice.",
      "“I wanted Brunel to know that he no longer has the power over me,” Giuffre said, “that I am a grown woman now and I’ve decided to hold him accountable for what he did to me and so many others.”",
      "Giuffre moved to Australia with her husband before Epstein’s 2019 arrest. The couple has three children.",
      "Her brother, Danny Wilson, told NBC News she \"pushed so hard to snuff the evil out\" of the world.",
      "\"Her biggest push was, 'If I don’t do this, nobody’s going to do it,'\" he said, regarding her advocacy. \"She was in real physical pain — suffered from renal failure. But I think that the mental pain was worse.\"",
      "The Epstein story received renewed attention during the most recent presidential election, and in February, Attorney General Pam Bondi released a collection of Epstein-related files to right-wing media figures and then to the public.",
      "Though the release was widely panned for containing information that was almost entirely previously public, the lead-up to its release — including concerns about the disclosure of sensitive or personally identifying information about victims — had been a source of distress and anxiety for victims in recent months, multiple victims told NBC News.",
      "Giuffre’s lawyer, Sigrid McCawley, described her as a “dear friend and an incredible champion for other victims.”",
      "Those who were close to Giuffre said they remembered her as a fighter.",
      "\"Virginia was one of the most extraordinary human beings I have ever had the honor to know,\" her representative, Dini von Mueffling, said.",
      "And McCawley said, “Her courage pushed me to fight harder, and her strength was awe-inspiring.\"",
      "In an interview for a \"Dateline\" NBC special on Epstein that aired before authorities charged Maxwell and Brunel, Giuffre urged law enforcement to act.",
      "\"Take us serious,\" she said. \"We matter.\"",
      "If you or someone you know is in crisis, call 988 to reach the Suicide and Crisis Lifeline. You can also call the network, previously known as the National Suicide Prevention Lifeline, at 800-273-8255, text HOME to 741741 or visit SpeakingOfSuicide.com/resources for additional resources.",
      "Sarah Fitzpatrick is a senior investigative producer and story editor for NBC News. She previously worked for CBS News and \"60 Minutes.\"",
      "Rich Schapiro is a reporter for the NBC News Investigative Unit."
    ]
  },
  {
    "url": "https://www.nbcnews.com/sports/nfl/shedeur-sanders-selected-cleveland-browns-falling-fifth-nfl-draft-rcna203080",
    "title": "Shedeur Sanders selected by Cleveland Browns after falling to fifth round of NFL draft",
    "paragraphs": [
      "The Cleveland Browns selected Colorado quarterback Shedeur Sanders with the 144th pick in the fifth round of the NFL draft on Saturday, a surprising slide down the boards for a prospect considered by many a first-round lock.",
      "Sanders was a lightning rod during draft season. While many projected him as a first-round selection — anywhere as high as No. 3 to the New York Giants or No. 21 to the Pittsburgh Steelers — he went undrafted on the first two nights.",
      "Ultimately, he was selected in the fifth round by Cleveland. Five quarterbacks — Miami’s Cam Ward, Ole Miss’ Jaxson Dart, Louisville’s Tyler Shough, Alabama’s Jalen Milroe and Oregon’s Dillon Gabriel — went ahead of Sanders.",
      "Minutes after the pick was made, Sanders posted to X, simply saying, “Thank you GOD.”",
      "The Browns shortly afterward posted a sizzle reel of Sanders with the caption, “Another playmaker in the mix.”",
      "“We felt like he was a good solid prospect at the most important position,” Andrew Berry, Browns executive vice president and general manager, said in a statement issued by the team. “We view him as a highly accurate pocket passer who does a good job of taking care of the ball ... We’re excited to work with him.”",
      "Sanders joins a crowded quarterback room in Cleveland and is the second play caller picked by the Browns this draft, after Dillon Gabriel. Veteran QBs Joe Flacco and Kenny Pickett are already on the roster.",
      "Entering Saturday, Sanders was the best prospect still available, according to NBC Sports’ Connor Rogers, who ranked Sanders 30th on his NFL draft board.",
      "Sanders, the son of NFL Hall of Famer and Buffaloes coach Deion Sanders, began his collegiate career at Jackson State in 2021 when his father was the head coach. Both left for Colorado after the 2022 season, and Shedeur Sanders spent his final two years in college with the Buffaloes.",
      "In his senior season, Sanders won Big 12 offensive player of the year,  completing 74.0% of his passes, with 37 touchdowns and 10 interceptions. He also threw 4,134 yards.",
      "Sanders was a key figure in Colorado’s turnaround as a football program. The school won only one game the season before his arrival. In 2024, the Buffaloes won nine games for the first time since 2016.",
      "In the lead-up to the draft, Sanders was the target of several scouts and coaches, with his character off the field often being called into question.",
      "Rohan Nadkarni is a sports reporter for NBC News."
    ]
  },
  {
    "url": "https://www.nbcnews.com/news/crime-courts/sean-combs-lawyers-judge-diddy-newsletter-rcna203008",
    "title": "Meet the judge and the lawyers at the center of Diddy's case",
    "paragraphs": [
      "This is a free newsletter for Diddy on Trial newsletter subscribers. Sign up to get exclusive reporting and analysis throughout Sean Combs' federal trial.",
      "We’re just nine days away from the start of jury selection in United States v. Combs. In today’s edition of Diddy on Trial, I’ll introduce you to the presiding judge and the lawyers on both sides of the case. Plus, we take a question from one of our subscribers. But first, here’s a rundown of our latest reporting:",
      "Was this newsletter forwarded to you? Sign up here for daily editions during the trial, including exclusive insights and analysis from our team inside the courthouse. If you have questions about what to expect, get in touch at diddyontrial@nbcuni.com.",
      "Joe Demosthenes, one of our readers, wants to know who is on the list of expected witnesses. We put that question to Janelle, who sent over this reply:",
      "The witness list has not been made public and it’s unclear whether one will. But we do know that four women — all accusers — will testify at Diddy’s trial. That’s according to a court filing from federal prosecutors.",
      "Three of the accusers will testify using pseudonyms to shield their identities from the public and the media. Their names are known to Diddy and his legal team. The woman identified in the indictment as Victim-1 has leveled allegations that closely align with those of Diddy’s ex-girlfriend, R&B singer Cassie.",
      "Victim-1 is prepared to testify under her own name, the filing said.",
      "By Daniel Arkin",
      "If you’ve ever spent time in an American courtroom, it’s easy to see why so many people have likened the experience to watching a play. The figures who populate the courtroom oftentimes resemble characters in a tense, high-stakes drama.",
      "In that vein, consider this edition of Diddy on Trial a short guide to some of the case’s cast members. In the weeks and months ahead, their names will become increasingly familiar to readers of this newsletter.",
      "Let’s start with the judge, Arun Subramanian. Subramanian has been on the federal bench for about two years. He was nominated to the U.S. District Court for the Southern District of New York by then-President Joe Biden in 2022 and confirmed by the U.S. Senate in 2023 in a 59-37 vote. (Sen. Chuck Schumer, D-N.Y., reportedly recommended Subramanian to Biden.)",
      "Diddy’s trial appears to be the most high-profile judicial assignment to date for Subramanian, who once clerked for the late Supreme Court Justice Ruth Bader Ginsburg before working at the white shoe Manhattan law firm Susman Godfrey.",
      "Diddy’s lead attorneys are no strangers to high-profile cases. Marc Antony Agnifilo, a veteran criminal defense lawyer, previously represented NXIVM sex cult leader Keith Raniere, former Goldman Sachs banker Roger Ng, former International Monetary Fund chief Dominique Strauss-Kahn and “Pharma Bro” Martin Shkreli.",
      "Agnifilo will be joined by Teny Geragos, one of the partners at his firm. She is “particularly experienced in defending and investigating allegations of sexual misconduct,” the firm’s website says. She is also the daughter of famed defense lawyer Mark Geragos, whose clients have included artists Michael Jackson and Chris Brown.",
      "The court docket lists five other attorneys on Diddy’s side, including Alexandra Shapiro and Brian Steel. Steel, who recently joined the defense team, represented rapper Young Thug in Georgia’s longest-running criminal trial.",
      "The same docket lists eight lawyers for the federal government, five of whom are designated as leads for the prosecution. They include Emily Anne Johnson, Madison Reddick Smyser, Mary Christine Slavik, Meredith Foster and Mitzi Steiner.",
      "The prosecution’s side features Maurene Ryan Comey, too. She’s a veteran of the Southern District who helped secure a conviction against British socialite Ghislaine Maxwell for conspiring with Jeffrey Epstein. Maurene Comey is the daughter of former FBI Director James Comey.",
      "Daniel Arkin is a national reporter at NBC News."
    ]
  },
  {
    "url": "https://www.nbcnews.com/world/asia/kashmir-attack-tourists-pushes-india-pakistan-ties-brink-rcna202941",
    "title": "How a meadow filled with tourists became the site of a massacre",
    "paragraphs": [
      "SRINAGAR, India — After trekking through streams and forests in Indian-administered Kashmir, Sheetal Kalthia and her vacationing family had just arrived in a remote, picturesque meadow when they heard gunshots.",
      "Kalthia, who was with her husband and their two children, said they “sensed that something was wrong and ran to hide behind the tent, but they suddenly were standing in front of us.”",
      "Militants armed with rifles had descended on tourists in the meadow from the surrounding woods, identifying non-Muslims and then separating the men from the women and children.",
      "One of the militants “shot six to seven men in front of me,” Kalthia said, before shooting her husband, Shailesh.",
      "“My husband died in my lap, and I couldn’t do anything about it,” she told reporters Thursday at his funeral in their hometown of Surat in the Indian state of Gujarat.",
      "Twenty-six people were killed in the Tuesday attack, which took place in one of Kashmir’s top tourist destinations, the Baisaran Valley, whose lush green meadows, dense pine forests and snowcapped mountains have led it to be called India’s “mini Switzerland.”",
      "It was the deadliest attack on Indian civilians in almost two decades, and took place while Vice President JD Vance and his family were visiting another part of India. All but one of those killed were Indian nationals; the other was from Nepal.",
      "The attack near the town of Pahalgam in Kashmir, a disputed Himalayan region that is the only Muslim-majority part of India, has devastated the local tourism industry on which many rely for their livelihood. It also undermined Indian Prime Minister Narendra Modi’s insistence that the security situation had stabilized after a decadeslong separatist insurgency.",
      "New Delhi has responded with fury, immediately downgrading ties with neighboring Pakistan, which it has long accused of supporting cross-border terrorism. Indian officials say the gunmen had ties to militant groups based in Pakistan, which denies any involvement.",
      "Relations between the two nuclear powers, which both rule parts of Kashmir and have fought two wars over the region, are now at their lowest point in years after tit-for-tat treaty suspensions and the expulsion of diplomats and civilians. On Saturday, Indian and Pakistani troops exchanged gunfire for the second day in a row along the Line of Control that divides the two parts of Kashmir.",
      "Modi, a Hindu nationalist who has overseen a crackdown on dissent in Kashmir, vowed retribution for the attack. The family homes of several suspects have been demolished.",
      "“I say to the whole world, India will identify, track and punish every terrorist and their backers,” he said Thursday.",
      "President Donald Trump, who is close with Modi, said the Indian leader has his “full support.”",
      "For Indians watching Modi’s speech, it was an echo of 2019 when a convoy of Indian security forces was blown up in Kashmir and he responded by launching aerial strikes on Pakistan.",
      "Six years later, Indian nationalism is higher than ever, the Pakistan military’s grip on power has weakened, and the U.S. is no longer in Afghanistan, which analysts say historically deterred violence between India and Pakistan.",
      "“That perhaps gives India a bit of a blank check to do whatever it pleases,” said Chietigj Bajpaee, a senior research fellow for South Asia at Chatham House, a London-based think tank.",
      "Resentment between India and Pakistan dates to 1947, when Hindu-majority India gained independence from British colonial rule and Muslim-majority Pakistan was established as a separate state in a deadly partition in which hundreds of thousands of people were killed while migrating across the newly formed border.",
      "The border lines were clearly defined and accepted except for the mountainous state of Jammu and Kashmir, which is among the most militarized places in the world. Both Pakistan and India lay full claim to it, but most of it is Indian-administered, while Pakistan controls a small chunk to the west.",
      "Tensions have escalated since Modi revoked Kashmir’s semiautonomous status in 2019, effectively putting the region under direct control of the federal government in a move that was criticized by rights groups and raised fears that Kashmir’s ethnic and religious identity would be diluted by Hindu settlers.",
      "Modi’s government said the move ended decades of armed rebellion in the region. Elections were held last year and hailed as a sign of normalcy.",
      "“One indicator of normalcy that the government was always giving out was, look, there are so many tourists visiting,” said Lt. Gen. Deependra Singh Hooda, former head of the Indian Army’s Northern Command, who was stationed in Jammu and Kashmir from 2012 to 2016.",
      "Praveen Donthi, a New Delhi-based senior analyst at the International Crisis Group, said the attack was a “colossal intelligence failure.”",
      "Modi’s narrative of peace and stability “led to complacency, which is why they did not see this coming,” he said.",
      "Pallavi Rao and her husband, Manjunath, had taken their son to Kashmir to celebrate his near-perfect score on his high school diploma exams. They had enjoyed a boat ride on the popular Dal lake in Kashmir’s main city of Srinagar before heading to Pahalgam about 30 miles away.",
      "The militants found them in the meadow.",
      "After her husband was shot in the head, Rao told reporters, she and her son asked the militants to kill them too. They refused, saying, “We won’t kill you. Go tell Prime Minister Modi.”",
      "A local pony handler, Syed Adil Hussain Shah, was also killed while trying to save the tourists.",
      "“He used to earn 300 rupees [$3.50] in a day, our only source of income in the family,” Ravisa Hussain Shah, his younger sister, told NBC News in an interview at their home in the village of Hapatnur.",
      "Among the first to reach the scene was Sajad Ahmad Bhat, 31, a shawl seller and tour guide.",
      "“I saw bodies lying on the ground,” he said.",
      "Bhat carried one of the victims almost 2.5 miles to safety, video of which went viral online.",
      "“I don’t know who the boy was. But he was crying and seeking help. His hands and sweater were soaked in blood,” he said.",
      "Since the attack, India has suspended a 1960 water treaty with Pakistan and closed the only functional land border crossing. Pakistan, which said any disruption to its water supply would be considered an “act of war,” has closed its airspace to Indian airlines and halted all trade with its neighbor.",
      "Analysts inside Pakistan say the government may use the situation to bring the Kashmir issue back into global discussions.",
      "“Pakistan can say, look, this happens because of India’s human rights violations in Kashmir,” said Farhan Siddiqi, a professor of international relations at Quaid-i-Azam University in Islamabad.",
      "On Wednesday, Kashmir observed a complete shutdown as locals and politicians marched through the streets denouncing the killings. Roads throughout Kashmir were deserted, with shops closed and no transport on the roads.",
      "“We wanted to exhibit that Kashmiris are nonviolent and peaceful people, and any innocent killings shouldn’t take place on our soil,” said Javed Ahmad Tenga, president of the Kashmir Chamber of Commerce and Industry.",
      "The United Nations has urged India and Pakistan to “exercise maximum restraint” and called for “meaningful, mutual engagement.” But Donthi and others say strong Indian military action against Pakistan is likely.",
      "“Anything less than the airstrikes in 2019 will not do. The public is seeking something much bigger,” Donthi said. “After riding the tiger of hypernationalism, the government has backed itself into a corner. This is their litmus test and they have to come out with flying colors.”",
      "Junaid Kathju reported from Srinagar, India, and Mithil Aggarwal reported from Hong Kong.",
      "Mithil Aggarwal is a Hong Kong-based reporter/producer for NBC News."
    ]
  },
  {
    "url": "https://www.nbcnews.com/health/health-news/florida-water-fluoridation-political-fluoride-kennedy-rcna200645",
    "title": "When the F-word is 'fluoride'",
    "paragraphs": [
      "Florida is poised to become the second state to ban the long-standing practice of adding fluoride to public water systems. State senators have already cleared a bill that would prohibit community water fluoridation, and Florida’s House is expected to vote on a similar bill in the coming week.",
      "The word “fluoride” isn’t found anywhere in the Florida Farm Bill, but it would be included because the legislation aims to ban “the use of certain additives in a water system” throughout the state.",
      "If Gov. Ron DeSantis, a Republican, signs the bill, Florida will become the second to ban fluoride from water supplies. Utah’s Gov. Spencer Cox, also a Republican, signed a bill in late March that prohibits any person or government entity from adding the cavity-fighting mineral from the state’s water systems. The Utah rule will go into effect on May 7.",
      "Similar legislation is making its way through other states, including Kentucky, Massachusetts and Nebraska.",
      "In Wisconsin, nearly 80 communities have already voted to stop adding fluoride, according to the state’s Department of Natural Resources, and others in the state are considering a ban. And Union County in North Carolina voted last year to remove fluoride from drinking water.",
      "Like the anti-vaccine movement, the push to pull fluoride from water has been gaining momentum for several decades. It’s grown more powerful with Robert F. Kennedy Jr. as head of the Department of Health and Human Services. Earlier this month, Kennedy said he was planning to tell the Centers for Disease Control and Prevention to stop recommending fluoride be added to water supplies.",
      "The agency doesn’t make official recommendations on fluoride, however. Those come from the U.S. Public Health Service, composed of members from various federal health public health agencies.",
      "He also said at the event, without providing evidence, that “we know that there is no systemic advantage” to preventing tooth decay by drinking fluoridated water. “You can achieve that benefit from brushing teeth.”",
      "Water fluoridation has long been heralded as one of the top public health initiatives of the last century for its ability to drive down tooth decay.",
      "While defending fluoride in a Florida Senate debate on April 16, Sen. Tina Scott Polsky, a Democrat, said, “Find me a dentist who thinks we should get rid of fluoride.” The bill passed the Senate on April 16. The Florida House is controlled by Republicans and is expected to vote against fluoridation.",
      "Lorna Koci, head of the Utah Oral Health Coalition, an advocacy group that promotes oral health initiatives among Medicaid beneficiaries, said the movement against fluoride has nothing to do with health and science. “It really is a political issue,” she said.",
      "Kennedy, who has no training in medicine or dentistry, has previously referred to fluoride as “industrial waste” on the social media platform X and said on MSNBC that the faster the mineral goes away, the better.",
      "Historically, dentists and other oral health experts would have been vocal defenders of fluoride. Now, many feel that they’re in a losing battle against the anti-fluoride movement and worry about speaking publicly in favor of the mineral.",
      "“It’s like a four-letter word,” a public health dentist in the Southeast said. The mere mention of fluoride, even in the context of public education, is forbidden by superiors, the staffer said.",
      "“We can’t defend the science we believe in,” said another public health dentist in the Upper Midwest. Opposition to both fluoride and vaccines has become more vocal locally because of what’s happening on the national level, he said. “It’s basically giving them a boost.” Public health dentists work with a state or county to increase dental care access in underserved communities and promote oral health overall.",
      "Last month, the Trump administration pulled more than $11 billion earmarked for state public health departments. As part of the mass layoffs at health agencies ordered by Kennedy, HHS gutted the CDC’s oral health division, which provides funds to states and local jurisdictions to promote good dental health practices, including the use of fluoride.",
      "Dentists argue that while fluoridated toothpaste is critical in preventing cavities, underserved communities may not be able to afford it. Many, they say, are unable to go to a dentist for fluoride treatments.",
      "Dr. Johnny Johnson, a pediatric dentist and president of the American Fluoridation Society, a fluoride advocacy group, said legislators opposed to water fluoridation “need to be skewered over total disregard for our residents’ health.”",
      "An HHS spokesman didn’t respond to a question about how the federal government might address those disparities.",
      "Speaking publicly about the benefits of the mineral might result in a target on the backs of health departments already strapped for cash, fluoride advocates say.",
      "A year ago, “fluoride was fine to bring up” in discussions with public health leaders, said Koci.",
      "Now, “I think many people in public health are feeling like they need to just lay low. It’s probably very risky to be taking a position on a topic that is so political and controversial.”",
      "Major public health groups, including the American Dental Association, the American Academy of Pediatrics and the CDC, support the use of fluoridated water. All cite studies that show it reduces tooth decay by 25%.",
      "Before the Florida Senate vote, more than a dozen jurisdictions in the state, including Seminole County, had banned water fluoridation despite decades of the mineral being safely used in the water supply and evidence that it fights cavities.",
      "In November 2024, the state’s surgeon general, Joseph Ladapo, said communities should stop adding fluoride to drinking water because of what he called “neuropsychiatric risk.”",
      "At least one of those bans has been overruled. Miami Mayor Daniella Levine Cava promised to veto her county commissioners’ vote to remove fluoride.",
      "“While it may be relatively simple to stop adding fluoride as directed in the resolution, the long-term effects of doing so are anything but simple, and so we must consider the long-term consequences,” Levine Cava said during a news conference earlier this month. “Ending fluoridation could have real and lasting harm, especially for children and families who cannot afford regular dental care.”",
      "Similar to the anti-vaccine movement, which has focused on widely debunked research associating the mumps, measles and rubella shots with autism, groups opposed to fluoride tend to seize on a study that suggests the mineral is a neurotoxin that lowers children’s level of intelligence.",
      "A study published in 2019 suggested that IQ levels were slightly lower in kids whose mothers had higher measures of fluoride in their urine during pregnancy. The research was far from conclusive.",
      "Other studies looking at how fluoride affects children’s brains have been called “low quality” by health scientists and were conducted in other countries.",
      "Another public health dentist said that faced with extensive funding cuts for any public health measures, fluoride isn’t “the hill they want to die on.”",
      "Dentists predict they’ll see a jump in dental decay, especially among kids, in the coming years.",
      "Dr. Tom Reid, president of the Wisconsin Dental Association, said that within the next three to five years, those towns can expect to see a significant increase in rates of tooth decay.",
      "“It’s disheartening,” Reid said. Dentists aren’t pushing for fluoride for their own benefit, he said. “We’re really trying to act in what is the best for the health of our patients, for the health of our communities.”",
      "It’s what happened in the Canadian city of Calgary, for example, after leaders there voted to remove fluoride from public water in 2011. A decade later, they voted to reinstate community water fluoridation amid a significant rise in cavities among kids.",
      "In Seminole County, Florida, which voted earlier this month to get fluoride out of the water system, utilities director Johnny Edwards said during the meeting that it would save the county at least $100,000.",
      "When asked whether the county would set aside that money to treat a potential increase in cavities, Chris Patton, a spokesman for the county, chuckled. No, he said, it will simply be reabsorbed into the county’s utilities department.",
      "Erika Edwards is a health and medical news writer and reporter for NBC News and \"TODAY.\""
    ]
  },
  {
    "url": "https://www.nbcnews.com/sports/nba/kawhi-leonard-renaissance-nba-didnt-see-coming-rcna203004",
    "title": "The Kawhi Leonard renaissance that the NBA didn't see coming",
    "paragraphs": [
      "LOS ANGELES — Thursday night was the kind of scene the Los Angeles Clippers have dreamed about for nearly a decade: a raucous, sold-out crowd erupting in cheers following the first playoff win in their own arena.",
      "After taking a resounding 2-1 lead in their first-round series against Denver, the Clippers are the NBA championship contender that no one predicted.",
      "And it has been made possible by the career renaissance few saw coming.",
      "In recent weeks, Kawhi Leonard has looked every bit the elite scorer and perimeter defender the Clippers thought they were getting in 2019 when Leonard, weeks removed from earning the second NBA Finals MVP honor of his career, signed with the Clippers in a free-agency coup.",
      "Yet that was six years ago, a lifetime in a league where championship windows open rarely and close quickly.",
      "\"The best thing for him was taking the summer off and getting right,\" said an executive from a rival team. \"I just can't believe how skinny he looks. He just looks like he's so much lighter and moving so much better and playing back to the way he was before. It's just amazing.\"",
      "Leonard has looked this dominant in the postseason before while in a Clippers uniform, starting in 2021. But during a second-round series against Utah, just as Leonard and Paul George were playing their best as teammates, Leonard took an innocuous bump from Utah's Joe Ingles on a fast break and missed the rest of that postseason, and the entire 2021-22 season, as well, with a knee injury that required surgery.",
      "Clippers playoff runs in 2023 and 2024 also ended with Leonard injured — a string of strains, inflammation and partial and complete tears to knee ligaments that left other teams so scared about his ability to stay on the court that in 2023, executives around the NBA described his trade value as zilch.",
      "Entering this season, his premature endings to past campaigns, along with the departure of George in free agency, lowered his team’s championship expectations. Oddsmakers put the Clippers’ over-under for victories at 35.5 wins. Leonard didn’t even make his season debut until early January — when half the season was over.",
      "Yet the Clippers finished with 50 wins anyway, after winning 18 of their last 21 games. And Leonard averaged 25.7 points on 52% shooting, including 42% on three-pointers, over his final 19 games.",
      "His injury history has led fans, scouts and executives around the league to continue to hold their breath as they wait to see how long Leonard can remain healthy while playing heavy minutes.",
      "\"If you have watched Kawhi closely enough you know what's possible,\" said Oscar-winning director and writer Phil Lord, a longtime Clippers fan. \"He made it possible. His elite work ethic has led once again to elite play. But I never want to see Joe Ingles anywhere near him ever again.\"",
      "Yet for now, Leonard has produced emphatic playoff moments, such as his 39 points while missing only four shots in a Game 2 win to even the Clippers’ series with Denver. In Game 3, he scored 21 points and grabbed 11 rebounds.",
      "“This is what Kawhi lives for,” Clippers coach Tyronn Lue said this week. “And we know if we have a healthy Kawhi, we can win any series.”",
      "Leonard himself could have predicted this. After returning from a knee injury following the 2023 season, he routinely described his recovery as a two-year timeline that he wasn’t looking to rush by “skipping steps.”",
      "“Anybody in the business that is playing knows how hard it is to come back from injury or playing in the NBA. They understand what we all go through and what I went through,” Leonard said after the win.",
      "As a beat reporter who covered Leonard daily during his first five seasons in Los Angeles, I have never been around a more routine-oriented player. Each pregame warmup was done at the same speed, with the same repetitions and drills, against the same assistant coaches. The irony that complicated his team’s championship ambitions, however, was that it was never predictable whether Leonard would be on the court.",
      "It had even led to criticism of Leonard’s desire to play. But Clint Parks, a skills trainer who worked with Leonard as a teenager and up to the start of his NBA career, said that could not be further from the motivation that has allowed Leonard to turn from an overlooked college recruit and NBA role player at the beginning of his career into a No. 1 option for a title team.",
      "“His self-belief from Day 1 has always been one of one. He’s never not believed in himself at the highest, highest level,” Parks said. “He’s always had this work ethic. He’s always been focused. He’s always been a self-starter. At 14, he said he wanted to be one of the best to ever play basketball. That was his thing.”",
      "“Over the years, he’s pushed toward that, and that’s exactly what he’s become, regardless of the injuries. People always talk about, ‘Oh, he could be top 10 if he didn’t miss all that time and wasn’t injured.’ Shoot, if he can finish the job and somehow bring home a championship to the Clippers, he will still be top 10 all time with all the injuries and everything and all the time he’s missed.”",
      "Each of the last two seasons, Leonard had produced stretches that resembled a return to the form that made him a six-time All-Star, two-time defensive player of the year and a member of the NBA’s team of the 75 all-time players. Yet in 2023, after a dominating start to a first-round playoff series against Phoenix, Leonard suffered a season-ending knee injury. And last year, after the Clippers looked to be the NBA’s best team for a two-month stretch, he hobbled out of the playoffs yet again in a loss to Dallas.",
      "The feeling around the league one year ago, said the rival executive, “was just like, ‘Uh-oh, here we go again.’”",
      "Playing under a carefully monitored ramp-up of his workload, it took Leonard one month after his season debut to crack 30 minutes for the first time. One month later, in March, he passed the 40-minute mark. And in the playoffs, he is passing most expectations for how this 33-year-old superstar could still perform.",
      "“He’s back to looking like the best player in the world,” Parks said.",
      "Andrew Greif is a freelance sports journalist."
    ]
  },
  {
    "url": "https://www.nbcnews.com/world/iran/iran-port-massive-explosion-rcna203147",
    "title": "A massive explosion at an Iranian port linked to missile fuel shipment kills 8, injures around 750",
    "paragraphs": [
      "MUSCAT, Oman — A massive explosion and fire rocked a port Saturday in southern Iran purportedly linked to a shipment of a chemical ingredient used to make missile propellant, killing eight people and injuring around 750 others.",
      "Helicopters dumped water from the air on the raging fire hours after the initial explosion, which happened at the Shahid Rajaei port just as Iran and the United States met Saturday in Oman for the third round of negotiations over Tehran’s rapidly advancing nuclear program.",
      "No one in Iran outright suggested that the explosion came from an attack. However, even Iranian Foreign Minister Abbas Araghchi, who led the talks, on Wednesday acknowledged that “our security services are on high alert given past instances of attempted sabotage and assassination operations designed to provoke a legitimate response.”",
      "Iranian Interior Minister Eskandar Momeni gave the casualty figure in an interview on state television. But there were few details on what sparked the blaze just outside of Bandar Abbas, which burned into Saturday night, causing other containers to reportedly explode.",
      "The port took in a shipment of “sodium perchlorate rocket fuel” in March, the private security firm Ambrey said. The fuel is part of a shipment from China by two vessels to Iran first reported in January by the Financial Times. The fuel was going to be used to replenish Iran’s missile stocks, which had been depleted by its direct attacks on Israel during the war with Hamas in the Gaza Strip.",
      "“The fire was reportedly the result of improper handling of a shipment of solid fuel intended for use in Iranian ballistic missiles,” Ambrey said.",
      "Ship-tracking data analyzed by The Associated Press put one of the vessels believed to be carrying the chemical in the vicinity in March, as Ambrey said. Iran hasn’t acknowledged taking the shipment. The Iranian mission to the United Nations didn’t respond to a request for comment on Saturday.",
      "It’s unclear why Iran wouldn’t have moved the chemicals from the port, particularly after the Beirut port blast in 2020. That explosion, caused by the ignition of hundreds of tons of highly explosive ammonium nitrate, killed more than 200 people and injured more than 6,000 others. However, Israel did target Iranian missile sites where Tehran uses industrial mixers to create solid fuel.",
      "Social media footage of the explosion on Saturday at Shahid Rajaei saw reddish-hued smoke rising from the fire just before the detonation. That suggests a chemical compound being involved in the blast — like in the Beirut explosion.",
      "“Get back get back! Tell the gas (truck) to go!” a man in one video shouted just before the blast. “Tell him to go, it’s going to blow up! Oh God, this is blowing up! Everybody evacuate! Get back! Get back!”",
      "On Saturday night, the state-run IRNA news agency said that the Customs Administration of Iran blamed a “stockpile of hazardous goods and chemical materials stored in the port area” for the blast, without elaborating.",
      "An aerial shot released by Iranian media after the blast showed fires burning at multiple locations in the port, with authorities later warning about air pollution from chemicals such as ammonia, sulfur dioxide and nitrogen dioxide in the air. Schools in Bandar Abbas will be closed Sunday as well.",
      "Shahid Rajaei has been a target before. A 2020 cyberattack attributed to Israel targeted the port. It came after Israel said that it thwarted a cyberattack targeting its water infrastructure, which it attributed to Iran. Israeli officials didn’t respond to requests for comment regarding Saturday’s explosion.",
      "Social media videos showed black billowing smoke after the blast. Others showed glass blown out of buildings kilometers, or miles, away from the epicenter of the explosion. State media footage showed the injured crowding into at least one hospital, with ambulances arriving as medics rushed one person by on a stretcher.",
      "Hasanzadeh, the provincial disaster management official, earlier told state television that the blast came from containers at Shahid Rajaei port in the city, without elaborating. State television also reported that there had been a building collapse caused by the explosion, though no further details were offered.",
      "The Interior Ministry said that it launched an investigation into the blast. Iranian President Masoud Pezeshkian also offered his condolences for those affected in the blast.",
      "Shahid Rajaei port in Hormozgan province is about 1,050 kilometers 650 miles southeast of Iran’s capital, Tehran, on the Strait of Hormuz, the narrow mouth of the Persian Gulf through which 20% of all oil traded passes.",
      "The Associated Press"
    ]
  },
  {
    "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/dorit-kemsley-real-housewives-beverly-hills-files-divorce-pk-kemsley-rcna203138",
    "title": "Dorit Kemsley of 'Real Housewives of Beverly Hills' files for divorce from PK Kemsley",
    "paragraphs": [
      "Dorit Kemsley has filed for divorce from her husband of 10 years, English businessman Paul \"PK\" Kemsley, seeking sole custody of their two children and spousal support.",
      "The 48-year-old \"Real Housewives of Beverly Hills\" star filed for the dissolution of her marriage to her 57-year-old husband on Friday, citing \"irreconcilable differences.\" The couple share two children, 11-year-old son Jagger and 9-year-old daughter Phoenix.",
      "The filing came one day after PK Kemsley was photographed on a romantic date with Shana Wall, a former contestant on Season 12 of the \"Amazing Race,\" E! News reported Thursday.",
      "\"I’m hurt, I’m sad,\" Dorit Kemsley said during a Season 14 reunion of \"RHOBH\" in early April. \"I think I’m realizing more and more each day that what I really believed was going to be my future may not be, and I think that realization is really f-----g hard.\"",
      "Although he was invited to appear on the Season 14 reunion, he declined, saying in a statement: \"I don't believe engaging with Dorit in this forum would be constructive.\"",
      "\"Dorit has made several mischaracterizations about me, but the one I must address is the claim that I am a bad father,\" he wrote. \"That statement is both heartbreaking and false. It is deeply hurtful to me and more importantly, to our children.\"",
      "During the reunion episode, Dorit Kemsley said her children now see their father on Saturday nights, \"if he's in town.\"",
      "Their separation was first announced in May 2024 in an Instagram post, which has since been deleted.",
      "\"To safe guard our deep friendship and maintain a harmonious environment for our children we have made the mutual and difficult decision to take some time apart and reevaluate our relationship while we prioritize our children,\" Dorit Kemsley's post read.",
      "Viola Flowers is a news associate for NBC News."
    ]
  }
]